src/DataProcessors/кпкОчисткаТрековЗаПериод/кпкОчисткаТрековЗаПериод.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>кпкОчисткаТрековЗаПериод</name>
  <comment>Очистка треков перемещений за период</comment>
  <attributes>
    <name>НачПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КонПериода</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаАгентов</name>
    <attributes>
      <name>Агент</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Пометка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

src/InformationRegisters/кпкСведенияАгента/кпкСведенияАгента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кпкСведенияАгента</name>
  <resources>
    <name>Ассортимент</name>
    <type>
      <types>CatalogRef.кпкАссортименты</types>
    </type>
  </resources>
  <resources>
    <name>СписокСкладов</name>
    <type>
      <types>CatalogRef.кпкСпискиСкладов</types>
    </type>
  </resources>
  <resources>
    <name>ПочтовыйЯщик</name>
    <comment>Адрес электронной почты агента</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ФТППапка</name>
    <comment>Папка агента на FTP сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>АПСПапка</name>
    <comment>Папка агента на Агент+ сервере</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПарольЗИП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновнаяФирма</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>КПК</name>
    <type>
      <types>CatalogRef.кпкКПК</types>
    </type>
  </resources>
  <resources>
    <name>ПередвижнойСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>ПрефиксНомеровДок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>CatalogRef.КассыККМ</types>
    </type>
  </resources>
  <resources>
    <name>КартаАгента</name>
    <type>
      <types>CatalogRef.кпкКарты</types>
    </type>
  </resources>
  <resources>
    <name>ЦветМаршрута</name>
    <comment>Цвет маршрута</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ВидОплатыПоУмолчанию</name>
    <type>
      <types>EnumRef.ВидыДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойСклад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </resources>
  <resources>
    <name>СписокКонтрагентов</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КассыАгента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ДоступностьТиповЦен</name>
    <type>
      <types>EnumRef.кпкДоступностьТиповЦен</types>
    </type>
  </resources>
  <resources>
    <name>ДоступныеТипыЦен</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТипМобильногоПриложения</name>
    <type>
      <types>EnumRef.кпкТипыМобильныхПриложений</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныеНастройки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ОсновнойТипЦены</name>
    <comment>Основной тип цены используемый агентов при создании документов в МУ</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>МинимальныйТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </resources>
  <resources>
    <name>ЦветПросроченныхДолгов</name>
    <comment>Цвет выделения просроченных долгов</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/кпкСведенияПоГПСТрекам/кпкСведенияПоГПСТрекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>кпкСведенияПоГПСТрекам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ИмяФайлаТреков</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Скорость</name>
    <comment>Скорость передвижения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Агент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ключ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/DataProcessors/кпкОчисткаТрековЗаПериод/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура ЗаполнитьТаблицуАгентов
//
// Параметры:
//  Нет
//
// Описание:
//	Процедура заполняет таблицу агентов для обработки из регистра сведений "Сведения агента"
// 
Процедура ЗаполнитьТаблицуАгентов() Экспорт
	
	ТаблицаАгентов.Очистить();
	
	ВыборкаРегистра = РегистрыСведений.кпкСведенияАгента.Выбрать();
	
	Пока ВыборкаРегистра.Следующий() Цикл
		
		СтрАгента 		  = ТаблицаАгентов.Добавить();
		СтрАгента.Агент   = ВыборкаРегистра.Объект;
		СтрАгента.Пометка = Истина;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьТаблицуАгентов()

// Процедура ВыполнитьОчисткуТреков
//
// Параметры:
//  Нет
//
// Описание:
//	Процедура выполняет очистку треков для указанных агентов по заданному периоду в параметрах обработки
//
Процедура ВыполнитьОчисткуТреков() Экспорт

	МассивАгентов = ТаблицаАгентов.ВыгрузитьКолонку("Агент");
	СписАгентов = Новый СписокЗначений;
	
	Для Каждого СтрокаМас Из МассивАгентов Цикл
		СписАгентов.Добавить(СтрокаМас);	
	КонецЦикла;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	кпкСведенияПоГПСТрекам.Период,
	|	кпкСведенияПоГПСТрекам.Агент,
	|	кпкСведенияПоГПСТрекам.ДатаСоздания,
	|	кпкСведенияПоГПСТрекам.Широта,
	|	кпкСведенияПоГПСТрекам.Долгота,
	|	кпкСведенияПоГПСТрекам.Ключ
	|ИЗ
	|	РегистрСведений.кпкСведенияПоГПСТрекам КАК кпкСведенияПоГПСТрекам
	|ГДЕ
	|	кпкСведенияПоГПСТрекам.Период МЕЖДУ &НачПериод И &КонПериод
	|	И кпкСведенияПоГПСТрекам.Агент В(&СписокАгентов)");
	
	Запрос.УстановитьПараметр("НачПериод", 	   НачалоДня(НачПериода));
	Запрос.УстановитьПараметр("КонПериод", 	   КонецДня(КонПериода));
	Запрос.УстановитьПараметр("СписокАгентов", СписАгентов);
	
	ВыборкаГПС = Запрос.Выполнить().Выбрать();
 
	Менеджер = РегистрыСведений.кпкСведенияПоГПСТрекам.СоздатьМенеджерЗаписи();
	
	Пока ВыборкаГПС.Следующий() Цикл
		Менеджер.Период       = ВыборкаГПС.Период;
		Менеджер.Агент        = ВыборкаГПС.Агент;
		Менеджер.Ключ         = ВыборкаГПС.Ключ;
		Менеджер.Прочитать();
		
		Если Менеджер.Выбран() Тогда
			Менеджер.Удалить();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры //ВыполнитьОчисткуТреков()
